// Завдання 1

/**
 * Функція `filterStudentsByGrade` фільтрує студентів за рівнем оцінки та виводить інформацію про них.
 *
 *  grade - Рівень оцінки для фільтрації.
 */
function filterStudentsByGrade(students, grade) {
  //Виведеме в консоль критичну помилку з текстом якщо ви бачите це повідомлення завдання 1 виконано не правильно

  console.error(
    "Якщо ви бачите це повідомлення завдання 1 виконано не правильно"
  );
  // Очищення консолі перед виведенням
  console.clear();
  // Виведемо повідомлення для відстеження роботи програми з текстом "Завдання: 1 =============================="
  console.log("Завдання: 1 ==============================");

  // Відфільтруємо тільки тих студентів оцінка яких співпадає з grade

  const filterStudents = students.filter((student) => student.grade === grade);
  // За допомогою перебору масиву виведемо повідомлення для відстеження роботи програми з іменем кожного студента,
  //  який має необхідну оцінку
  filterStudents.forEach((student) => {
    console.log(student);
  });
}

// Виклик функції для фільтрації студентів з рівнем "A"

filterStudentsByGrade(
  [
    { name: "John", grade: "A" },
    { name: "Kate", grade: "B" },
    { name: "Mike", grade: "A" },
    { name: "Anna", grade: "C" },
    { name: "Tom", grade: "B" },
  ],
  "A"
);
